geo_logs = [['visit1', ['Москва', 'Россия']],
            ['visit2', ['Дели', 'Индия']],
            ['visit3', ['Владимир', 'Россия']],
            ['visit4', ['Лиссабон', 'Португалия']],
            ['visit5', ['Париж', 'Франция']],
            ['visit6', ['Лиссабон', 'Португалия']],
            ['visit7', ['Тула', 'Россия']],
            ['visit8', ['Тула', 'Россия']],
            ['visit9', ['Курск', 'Россия']],
            ['visit10', ['Архангельск', 'Россия']]
            ]
print(geo_logs[0])
print(geo_logs[2])
print(geo_logs[6])
print(geo_logs[7])
print(geo_logs[8])
print(geo_logs[9])

print('\n',geo_logs[0], geo_logs[2], geo_logs[6:9])
print('\n','Есть ли решение в 1 строку, но что бы как в первом варианте'
           ' был формат вывода?')
